#  author = Astrealzero
############################################################
# 项目日志
'''
2022/4/10  V0.1
窗口无边框，加载人物gif，无边框下鼠标拖动。
2022/4/13  v0.2
创建右键菜单。
增加人物切换选项
bug：运行程序后第一个操作或多次右键呼出菜单时会导致程序崩溃
bug：菜单多次操作会导致程序崩溃
2022/4/14  v0.3
增加左键点击语音
修复bug菜单多次操作导致的崩溃
2022/4/15  V0.4
优化人物切换菜单
增加新人物，同时切换人物后人物语音不同
2022/4/20  V0.5
增加人物移动功能(PS:仅限方向键移动)
2023/2/27  重启项目
2023/3/2   V0.6
更改了新的主要人物gif，封存旧人物gif
改进了语言模块
新增人物朝向控制选项
删除了人物按键移动功能
2023/3/3  v0.7
完善了人物朝向控制
修复了改变人物时方向未继承的情况
加入了鼠标拖动人物时的动作
修改了模块加载相关代码
修改了人物数组存储和调用的方式
增加更换人物功能
2023/3/7  v0.8
将鼠标左键移动修改为鼠标中间移动
暂时关闭语音功能（语音功能会导致点击人物时发生短暂卡顿）
正在修复点击人物后人物继续循环播放的bug
2024/7/18 v0.9
大幅度修改代码，节省大量无用操作
'''
############################################################
